#+TITLE: Editor settings
#+AUTHOR: umi

* SETTINGS
#+begin_src emacs-lisp
  (setq display-line-numbers-type 'relative)
  (global-display-line-numbers-mode 1)
  (scroll-bar-mode -1)
  (electric-pair-mode t)
  (add-to-list 'default-frame-alist
	       '(font . "FiraMono Nerd Font-10"))
#+end_src

#+RESULTS:
: ((font . FiraMono Nerd Font-20) (font . FiraMono Nerd Font-10) (vertical-scroll-bars))
